OpenFOAM_v2012/overset_test/overset/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

./Allrun.pre

runApplication overPimpleDyMFoam

#------------------------------------------------------------------------------
